{"num": 27, "macbook air": {}, "macbook pro": {}, "surface": {"best_buy": [{"information": {"price": "$899.00", "id": 19}, "review": [{"ProductId": 19, "time": "4 weeks ago", "rating": 3, "title": "Too much compromise", "content": "I bought a SP6 because I had heard Microsoft had taken strides to improve battery life and I like the idea behind a hybrid tablet. Battery life is indeed better, but relative to other tablets (e.g. iPad) the battery life still leaves a lot to be desired. Maybe 7 hours with normal use; other Windows devices can do a lot better. Windows just still doesn’t act as a good tablet OS; apps run hidden in the background, some apps aren’t optimized for touch, and it’s slow in ways that surprise (e.g. launching apps), and the Windows App Store still has a ton of garbage software. Very few of the apps you’d expect to see on a tablet/mobile device. The fact that it also doesn’t haven any USB-C ports came as a pretty big disappointment too.\r\n\r\nSo not great as a tablet; what about as a laptop? Eh. The keyboard is an extra $130 or so; it’s decent but connects to the tablet in a flimsy manner that requires some yoga positions to hold steady in the lap. The kickstand is nice, no arguments there, but think about it: to type with it in your lap, you’re basically balancing three thin points of connection to keep it sturdy. The iPad doesn’t have much articulation and the keyboard is flat, but it’s sturdy: you can pick the whole thing up by just the keyboard. The battery and power are middle-of-the-road for a windows laptop; if you get the $899 i5 model it’s not a bad deal except you still have to buy a keyboard.\r\n\r\nNo pen is included anymore, so I didn’t try that. On the SP4 it was okay.\r\n\r\nIf you want a Windows tablet, I can’t imagine that any is better than the Surface when all is considered. However, if want you want is an iPad-like tablet, this is not the device for you. I thought I’d get this instead of a new iPad Pro based on things I’d read, and it clear to me that either I’m just not interested in going back to Windows at all or I’m just too used to the ease and reliability of iOS in a tablet."}, {"ProductId": 19, "time": "3 weeks ago", "rating": 5, "title": "Awesome", "content": "I needed to get my wife something she could use for graduate school, something portable yet being able to use the full Microsoft suite. After looking at several products including full laptops I landed on the Surface Pro 6. The model is one of the most basic models but for her needs it does the job and more. She has told me over and over how awesome it is to have it and how nice the keyboard is to type on. It has a good solid weight to it but not heavy and has an excellent screen. I would recommend this product."}, {"ProductId": 19, "time": "1 month ago", "rating": 4, "title": "Awesome", "content": "This is my first time purchasing a surface pro. Awesome piece of hardware. The software needs a little more tuning. I find my self having to click on the keyboard icon because it won’t come up at times when I click on the input field. Uses quite a bit of battery, but I realized it’s because I have programs running in the background. The screen is amazing!!"}, {"ProductId": 19, "time": "3 days ago", "rating": 4, "title": "Tablet with keyboard", "content": "I like the convenience of this tablet, it is fast and very light, but the only thing is that when you go to move and lift it up the screen and keyboard come apart to easy and the plug has a magnet to it for easy charging but doesn't stay in place very well, I thought it was charged but found out the plug came out so had to charge again. This is the only things I don't like about the tablet."}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Continues to impress", "content": "Works better than my Surface Pro 4. Overall very happy with the purchase. Wish it did have more USB ports and a usb c port. I also have the docking station, but really to large to travel with. You can buy other usb 3.0 multi-port devices if you need additional ports. Just seems like something they could figure out."}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Great Tablet/Laptop", "content": "Highly recommended for work, music & anything else you might need a laptop/tablet for, detachable keyboard is amazing and has an FN button to change the functions of the F1-F12 keys, has all the regular features of Windows and has a tablet mode for convenience. Only con is hard drive space which is overpriced."}, {"ProductId": 19, "time": "2 weeks ago", "rating": 4, "title": "Happy but could be a 5 star review", "content": "We love the Surface Pro but really wanted to have the Pro Version of Windows 10 included in the deal. Since we are already spending nearly $1000 for the tablet and an additional $150 for a keyboard, not having to purchase a Windows 10 Pro version for $100 would have been great."}, {"ProductId": 19, "time": "1 month ago", "rating": 5, "title": "Love it. Much better than Ipad", "content": "I was debating on getting the ipad pro or this. So glad I went with the Surface. Absolutely love this thing. Works great. Love the form factor. Full windows is awesome! Can do anything on here!"}, {"ProductId": 19, "time": "3 days ago", "rating": 5, "title": "Amazing computer for a creator", "content": "Ever since my purchase I have been exponentially more productive. The portability and power of the surface gives me the freedom to create on the go. This has also opened me to more business opportunities which is always a bonus!"}, {"ProductId": 19, "time": "5 days ago", "rating": 5, "title": "Awesome tablet", "content": "I bought this so I could do photo editing and so I could I have a smaller and easier to transport laptop! I haven’t edited on it yet but the graphics and the accessibility is awesome! Would definitely recommend!"}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "excellent upgrade for microsoft!", "content": "great deal at Best Buy --exchanged old surface pro with a discount toward a new one. faster processor and better battery life on new surface pro 6! charger, keyboard and pen all compatible with older model!"}, {"ProductId": 19, "time": "3 days ago", "rating": 5, "title": "Love this computer.", "content": "This laptop is perfect for working on the go. Seamless transitions from laptop to tablet. Working on my doctorate and it does everything I need it to. Just wish it had one more USB port."}, {"ProductId": 19, "time": "3 days ago", "rating": 5, "title": "Great for school!", "content": "I bought this computer because my old laptop was falling apart. This computer is absolutely perfect for college students! It’s fast, lightweight, and does everything I need it to do!"}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "Powerful portable", "content": "We bought the Surface Pro for my husband so that he can have a portable, tablet style machine, that he can still do spreadsheets on. The Surface Pro fits that need very nicely!"}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Nothing beats a surface", "content": "I have bought several of these (older generation) for work and they are pretty rock solid (although the WiFi on one of them is a little flaky) this newer model is more of the same."}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "Easy to use", "content": "Purchased for husband who is technically challenged. He is loving the ease of using this product. It's lighter weight, perfect size, features are perfect for his business"}, {"ProductId": 19, "time": "5 days ago", "rating": 5, "title": "Little powerhouse", "content": "Great portable laptop for everyday use. Long battery life compared to most laptops, especially ones this powerful (about the same as a mobile processor)"}, {"ProductId": 19, "time": "3 weeks ago", "rating": 5, "title": "way faster", "content": "it is way faster then the pro 5. I had the old model and noticed the difference right away. The only flaw is only one usb port."}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Great tablet!", "content": "I bought this for my daughter, who is a freshman in college, and she absolutely loves it!! We are actually buying a second one for myself as well."}, {"ProductId": 19, "time": "3 weeks ago", "rating": 5, "title": "Great Pad/Computer", "content": "The Microsoft Surfaces is one of the most versatile PCs/Laptops on the market. Because of the touch screen its better in ways than the air."}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Perfect Tablet/Laptop Mix", "content": "Really loving this new surface. Was undecided about getting a new tablet or laptop, but found this device to meet both of those needs."}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "Love it!!", "content": "I could not ask for a better 3 in 1! I am so glad I choose this for my purchase! I love it! It's so easy to take everywhere!"}, {"ProductId": 19, "time": "3 weeks ago", "rating": 5, "title": "Best Surface Yet", "content": "Upgraded from a second gen unit and the difference is really noticeable. Hand writing recognition and pen support is great."}, {"ProductId": 19, "time": "4 days ago", "rating": 5, "title": "happy", "content": "very happy to finally have a surface pro. Still need to get the pen and keyboard but its great even without them."}, {"ProductId": 19, "time": "2 weeks ago", "rating": 4, "title": "Works well i love it. Does what i need it to do", "content": "I just saw consco has same item 200 less. Does best buy have a price guarentee with in a certin time of purchase."}, {"ProductId": 19, "time": "1 day ago", "rating": 5, "title": "Great tab/pc hybrid", "content": "It is an excellent tab/pc hybrid. I use it for work and home study. It's light enough, and has good power."}, {"ProductId": 19, "time": "3 days ago", "rating": 5, "title": "Great overall laptop", "content": "I love this item, easy navigation, color, web cam experience is great. Love the feel of the keyboard..."}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "Love it", "content": "Wasn't sure about this ..im 70 years old I thought I couldn't catch up to the technology...it was easy."}, {"ProductId": 19, "time": "1 week ago", "rating": 5, "title": "Great product", "content": "This thing is a beast. So much power in such a tiny package. This is a must have for any artist/designer."}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "Great laptop", "content": "I am enjoying using my laptop! I love the convenience of it. The speed and quality is great!"}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Great lap top", "content": "My daughters got this for a college art class really likes the size easy to carry around campus"}, {"ProductId": 19, "time": "3 weeks ago", "rating": 5, "title": "Love it", "content": "It’s really helpful when I need to draw diagrams in class and go back to typing too. VERY LIGHT"}, {"ProductId": 19, "time": "3 days ago", "rating": 5, "title": "Best Laptop", "content": "Microsoft killing the game right now. This laptop/Tablet hybrid is the best on the market"}, {"ProductId": 19, "time": "2 weeks ago", "rating": 5, "title": "Love it", "content": "Very happy with purchase. Screen is amazing. Color contrast is unlike anything Ive ever seem."}, {"ProductId": 19, "time": "4 days ago", "rating": 5, "title": "Best computer ever!!", "content": "I absolutely love this computer, works great, great color, fast, and very lightweight."}, {"ProductId": 19, "time": "3 days ago", "rating": 5, "title": "Very Nice", "content": "So Much Better than Android Tablets, Just use bluestacks to play android games"}, {"ProductId": 19, "time": "4 days ago", "rating": 4, "title": "Very good laptop, but the form factor has limits", "content": "Great laptop, but you need to make sure this form factor will work for you."}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "Surface Pro", "content": "Amazing device I ever purchased. I love it. If I could I would buy another"}, {"ProductId": 19, "time": "2 days ago", "rating": 5, "title": "i love my surface pro 6", "content": "it is elxcellent laptop or tablet it is great for traveling it is portable"}, {"ProductId": 19, "time": "2 weeks ago", "rating": 3, "title": "Meh Not for me.", "content": "It seems very well made but I returned it to get the larger faster model."}]}, {"information": {"price": "$799.00", "id": 20}, "review": [{"ProductId": 20, "time": "1 month ago", "rating": 2, "title": "Over all dissapointed", "content": "I am very unhappy that the surface one comes with Windows pro and on this one I have to pay extra, it makes literally no sense as a consumer to pay for something that the first Gen has. When I reached out to Microsoft and after an hour of basically nothing they just confirmed that I would have to pay for which I could gather my self. I am usually an Apple user so far I am unimpressed with the ports as well as. I am still within my 14 days and I am really considering doing an exchange for a mac instead. The surface laptop has beautiful display its touch screen and some nice features but for the price I feel like it should be more innovated.... I don't know that I would recommend it to a friend."}, {"ProductId": 20, "time": "5 days ago", "rating": 5, "title": "Good for student", "content": "I am an engineering student at UTA. I definitely recommend this laptop to another student. The base laptop is enough for college study and run student software. the big concern is about the Price which is so high for students and higher tag price for the high storage. it is expensive to buy w/ the bigger storage. the advantage is very light, I like the trackpad and keyboard. \r\nAs I say, it is just enough for study. Gaming or extensive software will not be effective on this laptop. I am thinking about to exchange to get higher spec if necessary. 128gb is too small when i have multiple softwares and need room to store"}, {"ProductId": 20, "time": "3 weeks ago", "rating": 5, "title": "Great laptop!", "content": "The Surface Laptop 2 is a great device. \r\n\r\nPros\r\n- Bright, clear and responsive touchscreen with pen input\r\n- Very fast\r\n- Windows Hello makes signing in very quick \r\n- Computer boots up in mere seconds \r\n- All day battery life\r\n\r\nCons\r\n- The only con I have come across is lack of USB-C. With that said I'm not really sure that is much of a con at this point though. My experience with other computers that use USB-C has been mixed. Not sure the technology is ready for primetime. \r\n\r\nIf your primary purpose for a laptop is not gaming, then this is the ideal choice."}, {"ProductId": 20, "time": "3 weeks ago", "rating": 5, "title": "Great laptop!", "content": "Love this Surface Laptop! Very fast and just powerful enough for all the things I need to do. I did have an issue when I first powered it up with windows 10 taking forever to load. I did some research and found it was a problem with a setting in windows and it seems to be a problem with some preloaded windows 10. I watched a YouTube video on how to change the setting and now it works perfectly. Definitely the best laptop I’ve owned."}, {"ProductId": 20, "time": "5 days ago", "rating": 5, "title": "Excellent battery life", "content": "This laptop has the best battery life I've seen from a laptop yet. I've only had to charge it once since purchasing it (it's been four days). The screen quality is also wonderful and the keyboard!!!!! It is so nice to type on!!!"}, {"ProductId": 20, "time": "3 days ago", "rating": 5, "title": "my intro to laptops", "content": "this was recommended by the salesperson. had no idea which brand or model to buy. this surface2 is way more than I would ever need, but in about 2 weeks I'll have wished I got the model with more computing capacity!"}, {"ProductId": 20, "time": "3 weeks ago", "rating": 5, "title": "Excellent laptop but limited storage", "content": "This laptop is super fast on startup and running tasks. Just be aware the base model has minimal storage space. Consider splurging for a higher trim"}, {"ProductId": 20, "time": "2 weeks ago", "rating": 1, "title": "Terrible new out of the box", "content": "I purchased this new and from the time I opened it up it was terrible. I returned it and even geek squad had issues with wiping the hard drive."}, {"ProductId": 20, "time": "5 days ago", "rating": 5, "title": "Great computer", "content": "The Surface is the best laptop on the market. We now have a Book, Pro and Laptop. By far the best purchases I’ve made on computers."}, {"ProductId": 20, "time": "5 days ago", "rating": 4, "title": "Great laptop for general use/school", "content": "Lightweight and starts up fast. Great laptop overall but will need an external hard drive due to being 128GB only."}, {"ProductId": 20, "time": "2 weeks ago", "rating": 4, "title": "Very light and versatile", "content": "We were looking for a lightweight computer that had the power to do what we needed and found it in this computer."}, {"ProductId": 20, "time": "3 weeks ago", "rating": 5, "title": "GREAT FOR TRAVEL OR JUST AT THE HOUSE", "content": "THIS IS GREAT AND EASY TO MANUVER IN, GREAT FOR NOVICE AS WELL AS AN ADVANCED PLAYER"}, {"ProductId": 20, "time": "3 weeks ago", "rating": 5, "title": "Great laptop", "content": "Light weight and versatile. Just what I needed for a member of our management team."}, {"ProductId": 20, "time": "3 days ago", "rating": 5, "title": "Its good", "content": "There is nothing bad to say about the quality slim and easy to use"}, {"ProductId": 20, "time": "4 days ago", "rating": 5, "title": "Great computer", "content": "This computer is highly functional and easy to use."}, {"ProductId": 20, "time": "2 weeks ago", "rating": 5, "title": "Excellent laptop", "content": "Easy to set up. Fast processing and very versatile"}]}, {"information": {"price": "$1,099.00", "id": 21}, "review": [{"ProductId": 21, "time": "1 month ago", "rating": 3, "title": "Enjoyable experience with outdated ports", "content": "So far ive had this since launch day and it has met my expectation so far. Ive noticed this is very snappy with all the mouse gestures, which have always been slow with my other laptop experiences (including the surface book gen 1). Screen is very bright and beautiful, keyboard is enjoyable to type on. The alcantara feels nice but now i fear eating around my laptop, but no stars docked for that because that will be on me if i dirty the keyboard. \r\nThe reason i gave this a 3 stars is for several reasons. First off, the previous surface laptop came with windows 10 pro, and now i have windows 10 home. for business use, this means that i have to pay extra money so i can use features such as remote desktop and hyper-v. The next reason is for keeping the mini display port. I know people are asking for usb-c, which i would love but all i care is for something more day-to-day, like a regular hdmi port. Now i have to buy an outdated adapter that i will only use for this device. \r\nApple is making an announcement on the 30th, If they come out something that blows this away i might jump ship. Meaning, if they have something for the same price with a better port selection (and better experience), why not buy a macbook and buy windows 10 pro ? I wasnt satisfied with the 2016 macbook pro, it was a little brick compared to this machine. And the fans kicked up allllll the time. So i'll probably have to play with the demo models when it comes out. \r\nOutside of the poor port selection and windows 10 downgrade, i am very satisfied with my experience and yes i do recommend this laptop. There are more pros than cons. A lightweight laptop with an amazing keyboard + great display mean a lot when using a laptop for hours on end."}, {"ProductId": 21, "time": "1 week ago", "rating": 4, "title": "Best Windows Alternative to Macbook Air", "content": "If you want a laptop like the Macbook Air, but prefer Windows OS then this is for you. The Surface Laptop 2 has the same premium build quality and long battery life that the Air offers. It's thin, it's light, has an excellent display and lack of ports, all to similar to the Air. So who is this laptop for? It's for anyone looking for a lightweight computer with a beautifully sleek design with productivity in mind. This would be a great device for a student or anyone looking a general media consuming device. This laptop does not suit anyone looking to play graphic-intensive games as it does not have a dedicated graphics card. \r\n\r\nWhat's good about it?\r\nOverall design and build quality of the laptop is second to none (for Windows)\r\n13.5\" display with great quality and touch capability\r\nComfortable alcantara material on keyboard\r\nKeyboard has nice travel with minimal flex\r\nSpeakers are surprisingly decent for size of laptop\r\nQuad-core 8th gen Intel processors\r\nLong battery life\r\nCharger has a USB port built into it\r\nNo fan noise\r\n\r\nWhat's not so good about it?\r\nOnly one USB port, no thunderbolt port\r\nSSD isn't as fast as other competitors\r\n\r\nNow for my needs, this was a great pick up. I got it during the Black Friday pricing which was $999 but of course you can get better specs/power on other laptops but for the portability and premium feel, I don't think you can beat this at $999."}, {"ProductId": 21, "time": "3 weeks ago", "rating": 5, "title": "Fantastic Laptop!", "content": "The Surface Laptop 2 is a great device. Here are my pros...\r\n1. Lightweight and easy to carry around.\r\n2. The screen is incredible, plus touch and pen support! \r\n3. The keyboard is as good as they come on a laptop. \r\n4. Quadcore processor has all the power I need\r\n5. No Fan! - I despise fan noise, and this one has no fan and stays quiet. \r\n6. The Alcantra fabric is a nice touch. \r\n7. The Surface Dock compatibility makes working at my desk a breeze. With a little tweaking of the default settings, I can simply close my lid (put the computer to sleep) and throw it in my bag. When I get home I can put it on the dock and it wakes up without even opening the lid. \r\n\r\nI see a lot of people complaining about the lack of USB-C but I\"m not sure that would have made the laptop any better. I had a laptop with USB-C prior to this and it was unreliable. Maybe in a few more years, USB-C will be ready as a reliable replacement. \r\n\r\nIn short, this is a nice looking, powerful, and reliable laptop. One would be hard pressed to find a better alternative."}, {"ProductId": 21, "time": "2 weeks ago", "rating": 4, "title": "Amazing Design-Beautiful. Would recommend laptop", "content": "I just started using this and absolutely love the design of the latptop (matte black). \r\n\r\nThe screen ratio is great and wish all laptops would move to this taller ratio. 16:9 is a terrible ratio in general for productivity, IMO and it is especially terrible on small screens, such as a laptop, so I'm glad to see Microsoft bucked this trend. \r\n\r\nThe keyboard is super quiet but doesn't feel squishy at all, which is a surprise, and the keys themselves have a bit of a soft touch finish to them which is very nice. With a keyboard this quiet I found it a little odd that trackpad is so loud when clicking. I much prefer the more solid feeling mac trackpad, although that's not saying the MS trackpad is bad, it's just different. It's pretty much a non issue, but something worth pointing out. \r\n\r\nDesign-wise, I don't like that the bottom half of the clamshell has angled edges and I think it would look much nicer (even if it made the overall product thicker) if the bottom half of the clamshell had perpendicular edges like the screen does. \r\n\r\nOverall I'm ecstatic to be back on a windows laptop and will proudly, smugly, open up this laptop, with the glossy Windows logo, in Mac-centric design agencies where I normally work."}, {"ProductId": 21, "time": "1 month ago", "rating": 1, "title": "Watch out Windows 10 Home OS", "content": "My black slt2 came with Windows 10 Home so watch out. There should be W10 Pro versions out there buy Best Buy doesn't have them yet.\r\nAnd yeah when you dig wayyyy down in the tech details you can see this version does say home. I have bought 50+ surface devices from Best Buy and they all have pro or S(which you can upgrade to pro) so bad on me for not reading through all the specs. Bad on best buy for not putting this product OS in the description. I certainly would not recommend this product version to a friend. Come on Best Buy change my mind....."}, {"ProductId": 21, "time": "2 weeks ago", "rating": 5, "title": "Excellent laptop!", "content": "I had a Surface Pro 4 and when the black I5 went on sale for $300 off I decided to trade in my SP$. BB gave $300 so for total $600 off couldn't resist. It is light and very fast. It is a lot smoother feeling than SP4. I love the black finish. Shows some fingerprints but easy to wipe off. I was debating between the i5 and i7 but when tried the i5 in store every thing opened nice and quick so felt i7 would be over kill for me. Very happy with my decision."}, {"ProductId": 21, "time": "3 weeks ago", "rating": 5, "title": "Great laptop for college", "content": "This laptop is super light, energy efficient and not to mention extremely fast. I have the i5 processor and it works phenomenally. The sound system on this laptop is astounding I literally watch movies on it all the time. In addition the face recognition feature is fantastic!!! Would definitely recommend to anyone who's looking for a efficient laptop for a great price"}, {"ProductId": 21, "time": "1 week ago", "rating": 5, "title": "Excellent Laptop", "content": "This is our first laptop purchase in over 7yrs and I researched a lot before purchasing the Surface. Its well built, Fast and very light/slim. I have only had it for a week but have no complaints. If you're like me and keep a laptop for a while this seems well worth the price. If I had to make a suggestion it would be to add the pen with it, for it doesn't come with one."}, {"ProductId": 21, "time": "1 week ago", "rating": 4, "title": "Great Laptop, with a major flaw", "content": "As a longtime mac user, I was hesitant to make the switch. I love Windows 10, and for the most part I enjoy this laptop. My major gripe is the keyboard, specifically the difficulty I've had with cleaning. I have followed the cleaning instructions to the letter, with no luck. I would recommend this to a friend, but would warn them of the difficulty cleaning alacantara."}, {"ProductId": 21, "time": "3 days ago", "rating": 5, "title": "Excellent laptop", "content": "I needed a new computer and was unsure whether to buy Apple Mac or surfaces laptop 2 \r\n I am glad that I bought surface device \r\nEasy to set up and it’s a Microsoft product so it is very easy to use. \r\n It is very slim. Has nice touch to it and keyboard feels luxurious , I highly recommend this laptop . It is worth the money I spent"}, {"ProductId": 21, "time": "1 week ago", "rating": 5, "title": "So far, so great!", "content": "I switched from a mid-2012 macbook air and I'm very happy with this laptop! I really didn't like the new macbook airs so I knew it was time to make the change. The screen is beautiful and adjusting to the new operating system has been pretty easy. The black is sleek and I love the overall feel."}, {"ProductId": 21, "time": "1 week ago", "rating": 4, "title": "Like the design", "content": "My cousin saw it in store, asked for it, and I have ordered one for her. We have plenty of laptops in market with windows OS.I still wonder why can’t Microsoft provide office 360 for free with MS laptops? It makes the MS laptops little better when compared with other windows laptops in market."}, {"ProductId": 21, "time": "4 days ago", "rating": 5, "title": "Excellent laptop computer for work", "content": "Love this computer. Easy to work with, not too heavy. Love the speed of the processor. Comes loaded with some programs which comes in handy. The screen is divine!!! Love the clarity. A little pricey but well worth it. Highly recommend it!"}, {"ProductId": 21, "time": "1 week ago", "rating": 5, "title": "Microsoft- Here to stay", "content": "Wonderful design & specs. This laptop of course has some minor drawbacks like outdated ports but when you start using this bad boy, you will feel so comfortable that it outweighs its minor flaws .Microsoft has a vision and is here to stay."}, {"ProductId": 21, "time": "3 days ago", "rating": 4, "title": "The laptop is excellent.", "content": "The lap top is by far the best I have ever owned. However, the fabric material on the keyboard shows marks easily. I think I would have chosen a different surface material if I had known how easily the keyboard material shows marks."}, {"ProductId": 21, "time": "2 weeks ago", "rating": 4, "title": "Great laptop. Nearly perfect", "content": "If this thing had usb c and a smart card reader I would say it is the perfect laptop to buy for most people. That said, it’s incredible. Solid, beautiful, powerful, portable, and with a surface dock you have all the ports you need."}, {"ProductId": 21, "time": "4 days ago", "rating": 5, "title": "Love it!", "content": "First of all, the color is really sweet and eye Catchy. Switching from the MacBook pro was easy and I love it. The new quad core i5 makes a world's difference and I've had 0 issues with this laptop."}, {"ProductId": 21, "time": "2 weeks ago", "rating": 5, "title": "Great choice", "content": "I bought this product from doing careful deliberation. I had to search for “best laptops” in the internet. This was also recommended by a service rep when during a chat at best buy. Im glad I bought it."}, {"ProductId": 21, "time": "1 week ago", "rating": 5, "title": "An elegant and powerful device", "content": "I bought this the first minute it was available for pre-order and I fell in love the moment I first laid eyes on it. It just looks so elegant. It was also so fast and the performance is impressive."}, {"ProductId": 21, "time": "3 days ago", "rating": 5, "title": "Excellent computer. Fast, great form factor.", "content": "Former MacBook Pro guy. Love this computer. Processor is fast, the form factor is sleek and love the touch screen functionality afforded by Windows 10. Love the face recognition for sign in."}, {"ProductId": 21, "time": "3 weeks ago", "rating": 5, "title": "Awesome Laptop", "content": "This is a super convenient laptop that works extremely well. Light weight, fast, has all features I'm looking for and need. Brighter than competitive ones, e.g. Dell Inspiron. Love it."}, {"ProductId": 21, "time": "1 month ago", "rating": 2, "title": "Beautiful Laptop with Fatal Flaw", "content": "A beautiful laptop. A bit pricey. Unfortunately, this laptop lacks even the most basic ports/connectivity. Even the single USB-A port is the older 3.0 variety."}, {"ProductId": 21, "time": "3 weeks ago", "rating": 4, "title": "Awesome laptop", "content": "This is the updated version of the original surface that won so many did hard supporters!\r\nFantastic build quality and features."}, {"ProductId": 21, "time": "4 days ago", "rating": 5, "title": "terrific laptop", "content": "Very user friendly for people who are not very tech savy. Very thin and lightweight. Very comfortable keyboard"}, {"ProductId": 21, "time": "3 weeks ago", "rating": 5, "title": "best surface Pc yet", "content": "easy set up good performance Mircosoft hit it out of the park with this one. excellent up grade or first purchase."}, {"ProductId": 21, "time": "1 week ago", "rating": 5, "title": "Perfect Laptop", "content": "The best laptop on the market. Superior to my past MacBook pro in every way. Very comfortable to use."}, {"ProductId": 21, "time": "2 days ago", "rating": 5, "title": "Love my Surface", "content": "Great laptop for work and for students! Does everything that I need it to do and more!"}, {"ProductId": 21, "time": "5 days ago", "rating": 5, "title": "I made the switch from Apple!", "content": "Couldn’t be happier. Runs Microsoft Excel much better. Faster. What took me so long?"}, {"ProductId": 21, "time": "3 days ago", "rating": 5, "title": "Would recommend", "content": "Very fast lightweight computer that exceeded my expectations. Would recommend."}, {"ProductId": 21, "time": "1 day ago", "rating": 5, "title": "Great laptop", "content": "Excellent product, fast processor, great design.\r\nExceeded my expectations."}, {"ProductId": 21, "time": "3 days ago", "rating": 5, "title": "Great pck", "content": "Awesome computer,great for beginners on someone else’s, great price too."}, {"ProductId": 21, "time": "6 days ago", "rating": 5, "title": "I like my surface laptop. It looks quite good.", "content": "The surface laptop 2 is good. But It does not have word pre-installed."}]}, {"information": {"price": "$1,099.00", "id": 22}, "review": [{"ProductId": 22, "time": "1 month ago", "rating": 3, "title": "Enjoyable experience with outdated ports", "content": "So far ive had this since launch day and it has met my expectation so far. Ive noticed this is very snappy with all the mouse gestures, which have always been slow with my other laptop experiences (including the surface book gen 1). Screen is very bright and beautiful, keyboard is enjoyable to type on. The alcantara feels nice but now i fear eating around my laptop, but no stars docked for that because that will be on me if i dirty the keyboard. \r\nThe reason i gave this a 3 stars is for several reasons. First off, the previous surface laptop came with windows 10 pro, and now i have windows 10 home. for business use, this means that i have to pay extra money so i can use features such as remote desktop and hyper-v. The next reason is for keeping the mini display port. I know people are asking for usb-c, which i would love but all i care is for something more day-to-day, like a regular hdmi port. Now i have to buy an outdated adapter that i will only use for this device. \r\nApple is making an announcement on the 30th, If they come out something that blows this away i might jump ship. Meaning, if they have something for the same price with a better port selection (and better experience), why not buy a macbook and buy windows 10 pro ? I wasnt satisfied with the 2016 macbook pro, it was a little brick compared to this machine. And the fans kicked up allllll the time. So i'll probably have to play with the demo models when it comes out. \r\nOutside of the poor port selection and windows 10 downgrade, i am very satisfied with my experience and yes i do recommend this laptop. There are more pros than cons. A lightweight laptop with an amazing keyboard + great display mean a lot when using a laptop for hours on end."}, {"ProductId": 22, "time": "1 week ago", "rating": 4, "title": "Best Windows Alternative to Macbook Air", "content": "If you want a laptop like the Macbook Air, but prefer Windows OS then this is for you. The Surface Laptop 2 has the same premium build quality and long battery life that the Air offers. It's thin, it's light, has an excellent display and lack of ports, all to similar to the Air. So who is this laptop for? It's for anyone looking for a lightweight computer with a beautifully sleek design with productivity in mind. This would be a great device for a student or anyone looking a general media consuming device. This laptop does not suit anyone looking to play graphic-intensive games as it does not have a dedicated graphics card. \r\n\r\nWhat's good about it?\r\nOverall design and build quality of the laptop is second to none (for Windows)\r\n13.5\" display with great quality and touch capability\r\nComfortable alcantara material on keyboard\r\nKeyboard has nice travel with minimal flex\r\nSpeakers are surprisingly decent for size of laptop\r\nQuad-core 8th gen Intel processors\r\nLong battery life\r\nCharger has a USB port built into it\r\nNo fan noise\r\n\r\nWhat's not so good about it?\r\nOnly one USB port, no thunderbolt port\r\nSSD isn't as fast as other competitors\r\n\r\nNow for my needs, this was a great pick up. I got it during the Black Friday pricing which was $999 but of course you can get better specs/power on other laptops but for the portability and premium feel, I don't think you can beat this at $999."}, {"ProductId": 22, "time": "3 weeks ago", "rating": 5, "title": "Fantastic Laptop!", "content": "The Surface Laptop 2 is a great device. Here are my pros...\r\n1. Lightweight and easy to carry around.\r\n2. The screen is incredible, plus touch and pen support! \r\n3. The keyboard is as good as they come on a laptop. \r\n4. Quadcore processor has all the power I need\r\n5. No Fan! - I despise fan noise, and this one has no fan and stays quiet. \r\n6. The Alcantra fabric is a nice touch. \r\n7. The Surface Dock compatibility makes working at my desk a breeze. With a little tweaking of the default settings, I can simply close my lid (put the computer to sleep) and throw it in my bag. When I get home I can put it on the dock and it wakes up without even opening the lid. \r\n\r\nI see a lot of people complaining about the lack of USB-C but I\"m not sure that would have made the laptop any better. I had a laptop with USB-C prior to this and it was unreliable. Maybe in a few more years, USB-C will be ready as a reliable replacement. \r\n\r\nIn short, this is a nice looking, powerful, and reliable laptop. One would be hard pressed to find a better alternative."}, {"ProductId": 22, "time": "2 weeks ago", "rating": 4, "title": "Amazing Design-Beautiful. Would recommend laptop", "content": "I just started using this and absolutely love the design of the latptop (matte black). \r\n\r\nThe screen ratio is great and wish all laptops would move to this taller ratio. 16:9 is a terrible ratio in general for productivity, IMO and it is especially terrible on small screens, such as a laptop, so I'm glad to see Microsoft bucked this trend. \r\n\r\nThe keyboard is super quiet but doesn't feel squishy at all, which is a surprise, and the keys themselves have a bit of a soft touch finish to them which is very nice. With a keyboard this quiet I found it a little odd that trackpad is so loud when clicking. I much prefer the more solid feeling mac trackpad, although that's not saying the MS trackpad is bad, it's just different. It's pretty much a non issue, but something worth pointing out. \r\n\r\nDesign-wise, I don't like that the bottom half of the clamshell has angled edges and I think it would look much nicer (even if it made the overall product thicker) if the bottom half of the clamshell had perpendicular edges like the screen does. \r\n\r\nOverall I'm ecstatic to be back on a windows laptop and will proudly, smugly, open up this laptop, with the glossy Windows logo, in Mac-centric design agencies where I normally work."}, {"ProductId": 22, "time": "1 month ago", "rating": 1, "title": "Watch out Windows 10 Home OS", "content": "My black slt2 came with Windows 10 Home so watch out. There should be W10 Pro versions out there buy Best Buy doesn't have them yet.\r\nAnd yeah when you dig wayyyy down in the tech details you can see this version does say home. I have bought 50+ surface devices from Best Buy and they all have pro or S(which you can upgrade to pro) so bad on me for not reading through all the specs. Bad on best buy for not putting this product OS in the description. I certainly would not recommend this product version to a friend. Come on Best Buy change my mind....."}, {"ProductId": 22, "time": "2 weeks ago", "rating": 5, "title": "Excellent laptop!", "content": "I had a Surface Pro 4 and when the black I5 went on sale for $300 off I decided to trade in my SP$. BB gave $300 so for total $600 off couldn't resist. It is light and very fast. It is a lot smoother feeling than SP4. I love the black finish. Shows some fingerprints but easy to wipe off. I was debating between the i5 and i7 but when tried the i5 in store every thing opened nice and quick so felt i7 would be over kill for me. Very happy with my decision."}, {"ProductId": 22, "time": "3 weeks ago", "rating": 5, "title": "Great laptop for college", "content": "This laptop is super light, energy efficient and not to mention extremely fast. I have the i5 processor and it works phenomenally. The sound system on this laptop is astounding I literally watch movies on it all the time. In addition the face recognition feature is fantastic!!! Would definitely recommend to anyone who's looking for a efficient laptop for a great price"}, {"ProductId": 22, "time": "1 week ago", "rating": 5, "title": "Excellent Laptop", "content": "This is our first laptop purchase in over 7yrs and I researched a lot before purchasing the Surface. Its well built, Fast and very light/slim. I have only had it for a week but have no complaints. If you're like me and keep a laptop for a while this seems well worth the price. If I had to make a suggestion it would be to add the pen with it, for it doesn't come with one."}, {"ProductId": 22, "time": "1 week ago", "rating": 4, "title": "Great Laptop, with a major flaw", "content": "As a longtime mac user, I was hesitant to make the switch. I love Windows 10, and for the most part I enjoy this laptop. My major gripe is the keyboard, specifically the difficulty I've had with cleaning. I have followed the cleaning instructions to the letter, with no luck. I would recommend this to a friend, but would warn them of the difficulty cleaning alacantara."}, {"ProductId": 22, "time": "3 days ago", "rating": 5, "title": "Excellent laptop", "content": "I needed a new computer and was unsure whether to buy Apple Mac or surfaces laptop 2 \r\n I am glad that I bought surface device \r\nEasy to set up and it’s a Microsoft product so it is very easy to use. \r\n It is very slim. Has nice touch to it and keyboard feels luxurious , I highly recommend this laptop . It is worth the money I spent"}, {"ProductId": 22, "time": "1 week ago", "rating": 5, "title": "So far, so great!", "content": "I switched from a mid-2012 macbook air and I'm very happy with this laptop! I really didn't like the new macbook airs so I knew it was time to make the change. The screen is beautiful and adjusting to the new operating system has been pretty easy. The black is sleek and I love the overall feel."}, {"ProductId": 22, "time": "1 week ago", "rating": 4, "title": "Like the design", "content": "My cousin saw it in store, asked for it, and I have ordered one for her. We have plenty of laptops in market with windows OS.I still wonder why can’t Microsoft provide office 360 for free with MS laptops? It makes the MS laptops little better when compared with other windows laptops in market."}, {"ProductId": 22, "time": "4 days ago", "rating": 5, "title": "Excellent laptop computer for work", "content": "Love this computer. Easy to work with, not too heavy. Love the speed of the processor. Comes loaded with some programs which comes in handy. The screen is divine!!! Love the clarity. A little pricey but well worth it. Highly recommend it!"}, {"ProductId": 22, "time": "1 week ago", "rating": 5, "title": "Microsoft- Here to stay", "content": "Wonderful design & specs. This laptop of course has some minor drawbacks like outdated ports but when you start using this bad boy, you will feel so comfortable that it outweighs its minor flaws .Microsoft has a vision and is here to stay."}, {"ProductId": 22, "time": "3 days ago", "rating": 4, "title": "The laptop is excellent.", "content": "The lap top is by far the best I have ever owned. However, the fabric material on the keyboard shows marks easily. I think I would have chosen a different surface material if I had known how easily the keyboard material shows marks."}, {"ProductId": 22, "time": "2 weeks ago", "rating": 4, "title": "Great laptop. Nearly perfect", "content": "If this thing had usb c and a smart card reader I would say it is the perfect laptop to buy for most people. That said, it’s incredible. Solid, beautiful, powerful, portable, and with a surface dock you have all the ports you need."}, {"ProductId": 22, "time": "4 days ago", "rating": 5, "title": "Love it!", "content": "First of all, the color is really sweet and eye Catchy. Switching from the MacBook pro was easy and I love it. The new quad core i5 makes a world's difference and I've had 0 issues with this laptop."}, {"ProductId": 22, "time": "2 weeks ago", "rating": 5, "title": "Great choice", "content": "I bought this product from doing careful deliberation. I had to search for “best laptops” in the internet. This was also recommended by a service rep when during a chat at best buy. Im glad I bought it."}, {"ProductId": 22, "time": "1 week ago", "rating": 5, "title": "An elegant and powerful device", "content": "I bought this the first minute it was available for pre-order and I fell in love the moment I first laid eyes on it. It just looks so elegant. It was also so fast and the performance is impressive."}, {"ProductId": 22, "time": "3 days ago", "rating": 5, "title": "Excellent computer. Fast, great form factor.", "content": "Former MacBook Pro guy. Love this computer. Processor is fast, the form factor is sleek and love the touch screen functionality afforded by Windows 10. Love the face recognition for sign in."}, {"ProductId": 22, "time": "3 weeks ago", "rating": 5, "title": "Awesome Laptop", "content": "This is a super convenient laptop that works extremely well. Light weight, fast, has all features I'm looking for and need. Brighter than competitive ones, e.g. Dell Inspiron. Love it."}, {"ProductId": 22, "time": "1 month ago", "rating": 2, "title": "Beautiful Laptop with Fatal Flaw", "content": "A beautiful laptop. A bit pricey. Unfortunately, this laptop lacks even the most basic ports/connectivity. Even the single USB-A port is the older 3.0 variety."}, {"ProductId": 22, "time": "3 weeks ago", "rating": 4, "title": "Awesome laptop", "content": "This is the updated version of the original surface that won so many did hard supporters!\r\nFantastic build quality and features."}, {"ProductId": 22, "time": "4 days ago", "rating": 5, "title": "terrific laptop", "content": "Very user friendly for people who are not very tech savy. Very thin and lightweight. Very comfortable keyboard"}, {"ProductId": 22, "time": "3 weeks ago", "rating": 5, "title": "best surface Pc yet", "content": "easy set up good performance Mircosoft hit it out of the park with this one. excellent up grade or first purchase."}, {"ProductId": 22, "time": "1 week ago", "rating": 5, "title": "Perfect Laptop", "content": "The best laptop on the market. Superior to my past MacBook pro in every way. Very comfortable to use."}, {"ProductId": 22, "time": "2 days ago", "rating": 5, "title": "Love my Surface", "content": "Great laptop for work and for students! Does everything that I need it to do and more!"}, {"ProductId": 22, "time": "5 days ago", "rating": 5, "title": "I made the switch from Apple!", "content": "Couldn’t be happier. Runs Microsoft Excel much better. Faster. What took me so long?"}, {"ProductId": 22, "time": "3 days ago", "rating": 5, "title": "Would recommend", "content": "Very fast lightweight computer that exceeded my expectations. Would recommend."}, {"ProductId": 22, "time": "1 day ago", "rating": 5, "title": "Great laptop", "content": "Excellent product, fast processor, great design.\r\nExceeded my expectations."}, {"ProductId": 22, "time": "3 days ago", "rating": 5, "title": "Great pck", "content": "Awesome computer,great for beginners on someone else’s, great price too."}, {"ProductId": 22, "time": "6 days ago", "rating": 5, "title": "I like my surface laptop. It looks quite good.", "content": "The surface laptop 2 is good. But It does not have word pre-installed."}]}, {"information": {"price": "$1,099.00", "id": 23}, "review": [{"ProductId": 23, "time": "1 month ago", "rating": 3, "title": "Enjoyable experience with outdated ports", "content": "So far ive had this since launch day and it has met my expectation so far. Ive noticed this is very snappy with all the mouse gestures, which have always been slow with my other laptop experiences (including the surface book gen 1). Screen is very bright and beautiful, keyboard is enjoyable to type on. The alcantara feels nice but now i fear eating around my laptop, but no stars docked for that because that will be on me if i dirty the keyboard. \r\nThe reason i gave this a 3 stars is for several reasons. First off, the previous surface laptop came with windows 10 pro, and now i have windows 10 home. for business use, this means that i have to pay extra money so i can use features such as remote desktop and hyper-v. The next reason is for keeping the mini display port. I know people are asking for usb-c, which i would love but all i care is for something more day-to-day, like a regular hdmi port. Now i have to buy an outdated adapter that i will only use for this device. \r\nApple is making an announcement on the 30th, If they come out something that blows this away i might jump ship. Meaning, if they have something for the same price with a better port selection (and better experience), why not buy a macbook and buy windows 10 pro ? I wasnt satisfied with the 2016 macbook pro, it was a little brick compared to this machine. And the fans kicked up allllll the time. So i'll probably have to play with the demo models when it comes out. \r\nOutside of the poor port selection and windows 10 downgrade, i am very satisfied with my experience and yes i do recommend this laptop. There are more pros than cons. A lightweight laptop with an amazing keyboard + great display mean a lot when using a laptop for hours on end."}, {"ProductId": 23, "time": "1 week ago", "rating": 4, "title": "Best Windows Alternative to Macbook Air", "content": "If you want a laptop like the Macbook Air, but prefer Windows OS then this is for you. The Surface Laptop 2 has the same premium build quality and long battery life that the Air offers. It's thin, it's light, has an excellent display and lack of ports, all to similar to the Air. So who is this laptop for? It's for anyone looking for a lightweight computer with a beautifully sleek design with productivity in mind. This would be a great device for a student or anyone looking a general media consuming device. This laptop does not suit anyone looking to play graphic-intensive games as it does not have a dedicated graphics card. \r\n\r\nWhat's good about it?\r\nOverall design and build quality of the laptop is second to none (for Windows)\r\n13.5\" display with great quality and touch capability\r\nComfortable alcantara material on keyboard\r\nKeyboard has nice travel with minimal flex\r\nSpeakers are surprisingly decent for size of laptop\r\nQuad-core 8th gen Intel processors\r\nLong battery life\r\nCharger has a USB port built into it\r\nNo fan noise\r\n\r\nWhat's not so good about it?\r\nOnly one USB port, no thunderbolt port\r\nSSD isn't as fast as other competitors\r\n\r\nNow for my needs, this was a great pick up. I got it during the Black Friday pricing which was $999 but of course you can get better specs/power on other laptops but for the portability and premium feel, I don't think you can beat this at $999."}, {"ProductId": 23, "time": "3 weeks ago", "rating": 5, "title": "Fantastic Laptop!", "content": "The Surface Laptop 2 is a great device. Here are my pros...\r\n1. Lightweight and easy to carry around.\r\n2. The screen is incredible, plus touch and pen support! \r\n3. The keyboard is as good as they come on a laptop. \r\n4. Quadcore processor has all the power I need\r\n5. No Fan! - I despise fan noise, and this one has no fan and stays quiet. \r\n6. The Alcantra fabric is a nice touch. \r\n7. The Surface Dock compatibility makes working at my desk a breeze. With a little tweaking of the default settings, I can simply close my lid (put the computer to sleep) and throw it in my bag. When I get home I can put it on the dock and it wakes up without even opening the lid. \r\n\r\nI see a lot of people complaining about the lack of USB-C but I\"m not sure that would have made the laptop any better. I had a laptop with USB-C prior to this and it was unreliable. Maybe in a few more years, USB-C will be ready as a reliable replacement. \r\n\r\nIn short, this is a nice looking, powerful, and reliable laptop. One would be hard pressed to find a better alternative."}, {"ProductId": 23, "time": "2 weeks ago", "rating": 4, "title": "Amazing Design-Beautiful. Would recommend laptop", "content": "I just started using this and absolutely love the design of the latptop (matte black). \r\n\r\nThe screen ratio is great and wish all laptops would move to this taller ratio. 16:9 is a terrible ratio in general for productivity, IMO and it is especially terrible on small screens, such as a laptop, so I'm glad to see Microsoft bucked this trend. \r\n\r\nThe keyboard is super quiet but doesn't feel squishy at all, which is a surprise, and the keys themselves have a bit of a soft touch finish to them which is very nice. With a keyboard this quiet I found it a little odd that trackpad is so loud when clicking. I much prefer the more solid feeling mac trackpad, although that's not saying the MS trackpad is bad, it's just different. It's pretty much a non issue, but something worth pointing out. \r\n\r\nDesign-wise, I don't like that the bottom half of the clamshell has angled edges and I think it would look much nicer (even if it made the overall product thicker) if the bottom half of the clamshell had perpendicular edges like the screen does. \r\n\r\nOverall I'm ecstatic to be back on a windows laptop and will proudly, smugly, open up this laptop, with the glossy Windows logo, in Mac-centric design agencies where I normally work."}, {"ProductId": 23, "time": "1 month ago", "rating": 1, "title": "Watch out Windows 10 Home OS", "content": "My black slt2 came with Windows 10 Home so watch out. There should be W10 Pro versions out there buy Best Buy doesn't have them yet.\r\nAnd yeah when you dig wayyyy down in the tech details you can see this version does say home. I have bought 50+ surface devices from Best Buy and they all have pro or S(which you can upgrade to pro) so bad on me for not reading through all the specs. Bad on best buy for not putting this product OS in the description. I certainly would not recommend this product version to a friend. Come on Best Buy change my mind....."}, {"ProductId": 23, "time": "2 weeks ago", "rating": 5, "title": "Excellent laptop!", "content": "I had a Surface Pro 4 and when the black I5 went on sale for $300 off I decided to trade in my SP$. BB gave $300 so for total $600 off couldn't resist. It is light and very fast. It is a lot smoother feeling than SP4. I love the black finish. Shows some fingerprints but easy to wipe off. I was debating between the i5 and i7 but when tried the i5 in store every thing opened nice and quick so felt i7 would be over kill for me. Very happy with my decision."}, {"ProductId": 23, "time": "3 weeks ago", "rating": 5, "title": "Great laptop for college", "content": "This laptop is super light, energy efficient and not to mention extremely fast. I have the i5 processor and it works phenomenally. The sound system on this laptop is astounding I literally watch movies on it all the time. In addition the face recognition feature is fantastic!!! Would definitely recommend to anyone who's looking for a efficient laptop for a great price"}, {"ProductId": 23, "time": "1 week ago", "rating": 5, "title": "Excellent Laptop", "content": "This is our first laptop purchase in over 7yrs and I researched a lot before purchasing the Surface. Its well built, Fast and very light/slim. I have only had it for a week but have no complaints. If you're like me and keep a laptop for a while this seems well worth the price. If I had to make a suggestion it would be to add the pen with it, for it doesn't come with one."}, {"ProductId": 23, "time": "1 week ago", "rating": 4, "title": "Great Laptop, with a major flaw", "content": "As a longtime mac user, I was hesitant to make the switch. I love Windows 10, and for the most part I enjoy this laptop. My major gripe is the keyboard, specifically the difficulty I've had with cleaning. I have followed the cleaning instructions to the letter, with no luck. I would recommend this to a friend, but would warn them of the difficulty cleaning alacantara."}, {"ProductId": 23, "time": "3 days ago", "rating": 5, "title": "Excellent laptop", "content": "I needed a new computer and was unsure whether to buy Apple Mac or surfaces laptop 2 \r\n I am glad that I bought surface device \r\nEasy to set up and it’s a Microsoft product so it is very easy to use. \r\n It is very slim. Has nice touch to it and keyboard feels luxurious , I highly recommend this laptop . It is worth the money I spent"}, {"ProductId": 23, "time": "1 week ago", "rating": 5, "title": "So far, so great!", "content": "I switched from a mid-2012 macbook air and I'm very happy with this laptop! I really didn't like the new macbook airs so I knew it was time to make the change. The screen is beautiful and adjusting to the new operating system has been pretty easy. The black is sleek and I love the overall feel."}, {"ProductId": 23, "time": "1 week ago", "rating": 4, "title": "Like the design", "content": "My cousin saw it in store, asked for it, and I have ordered one for her. We have plenty of laptops in market with windows OS.I still wonder why can’t Microsoft provide office 360 for free with MS laptops? It makes the MS laptops little better when compared with other windows laptops in market."}, {"ProductId": 23, "time": "4 days ago", "rating": 5, "title": "Excellent laptop computer for work", "content": "Love this computer. Easy to work with, not too heavy. Love the speed of the processor. Comes loaded with some programs which comes in handy. The screen is divine!!! Love the clarity. A little pricey but well worth it. Highly recommend it!"}, {"ProductId": 23, "time": "1 week ago", "rating": 5, "title": "Microsoft- Here to stay", "content": "Wonderful design & specs. This laptop of course has some minor drawbacks like outdated ports but when you start using this bad boy, you will feel so comfortable that it outweighs its minor flaws .Microsoft has a vision and is here to stay."}, {"ProductId": 23, "time": "3 days ago", "rating": 4, "title": "The laptop is excellent.", "content": "The lap top is by far the best I have ever owned. However, the fabric material on the keyboard shows marks easily. I think I would have chosen a different surface material if I had known how easily the keyboard material shows marks."}, {"ProductId": 23, "time": "2 weeks ago", "rating": 4, "title": "Great laptop. Nearly perfect", "content": "If this thing had usb c and a smart card reader I would say it is the perfect laptop to buy for most people. That said, it’s incredible. Solid, beautiful, powerful, portable, and with a surface dock you have all the ports you need."}, {"ProductId": 23, "time": "4 days ago", "rating": 5, "title": "Love it!", "content": "First of all, the color is really sweet and eye Catchy. Switching from the MacBook pro was easy and I love it. The new quad core i5 makes a world's difference and I've had 0 issues with this laptop."}, {"ProductId": 23, "time": "2 weeks ago", "rating": 5, "title": "Great choice", "content": "I bought this product from doing careful deliberation. I had to search for “best laptops” in the internet. This was also recommended by a service rep when during a chat at best buy. Im glad I bought it."}, {"ProductId": 23, "time": "1 week ago", "rating": 5, "title": "An elegant and powerful device", "content": "I bought this the first minute it was available for pre-order and I fell in love the moment I first laid eyes on it. It just looks so elegant. It was also so fast and the performance is impressive."}, {"ProductId": 23, "time": "3 days ago", "rating": 5, "title": "Excellent computer. Fast, great form factor.", "content": "Former MacBook Pro guy. Love this computer. Processor is fast, the form factor is sleek and love the touch screen functionality afforded by Windows 10. Love the face recognition for sign in."}, {"ProductId": 23, "time": "3 weeks ago", "rating": 5, "title": "Awesome Laptop", "content": "This is a super convenient laptop that works extremely well. Light weight, fast, has all features I'm looking for and need. Brighter than competitive ones, e.g. Dell Inspiron. Love it."}, {"ProductId": 23, "time": "1 month ago", "rating": 2, "title": "Beautiful Laptop with Fatal Flaw", "content": "A beautiful laptop. A bit pricey. Unfortunately, this laptop lacks even the most basic ports/connectivity. Even the single USB-A port is the older 3.0 variety."}, {"ProductId": 23, "time": "3 weeks ago", "rating": 4, "title": "Awesome laptop", "content": "This is the updated version of the original surface that won so many did hard supporters!\r\nFantastic build quality and features."}, {"ProductId": 23, "time": "4 days ago", "rating": 5, "title": "terrific laptop", "content": "Very user friendly for people who are not very tech savy. Very thin and lightweight. Very comfortable keyboard"}, {"ProductId": 23, "time": "3 weeks ago", "rating": 5, "title": "best surface Pc yet", "content": "easy set up good performance Mircosoft hit it out of the park with this one. excellent up grade or first purchase."}, {"ProductId": 23, "time": "1 week ago", "rating": 5, "title": "Perfect Laptop", "content": "The best laptop on the market. Superior to my past MacBook pro in every way. Very comfortable to use."}, {"ProductId": 23, "time": "2 days ago", "rating": 5, "title": "Love my Surface", "content": "Great laptop for work and for students! Does everything that I need it to do and more!"}, {"ProductId": 23, "time": "5 days ago", "rating": 5, "title": "I made the switch from Apple!", "content": "Couldn’t be happier. Runs Microsoft Excel much better. Faster. What took me so long?"}, {"ProductId": 23, "time": "3 days ago", "rating": 5, "title": "Would recommend", "content": "Very fast lightweight computer that exceeded my expectations. Would recommend."}, {"ProductId": 23, "time": "1 day ago", "rating": 5, "title": "Great laptop", "content": "Excellent product, fast processor, great design.\r\nExceeded my expectations."}, {"ProductId": 23, "time": "3 days ago", "rating": 5, "title": "Great pck", "content": "Awesome computer,great for beginners on someone else’s, great price too."}, {"ProductId": 23, "time": "6 days ago", "rating": 5, "title": "I like my surface laptop. It looks quite good.", "content": "The surface laptop 2 is good. But It does not have word pre-installed."}]}], "amazon": [{"information": {"basic": "New Microsoft Surface Go (Intel Pentium Gold) Pick Your Own: Type Cover, Pen, Mouse, Docking Station and More(4 GB 64GB)", "price": "$489.99", "id": 24}, "review": [{"rating": 5, "title": "Microsoft does it right this time", "content": "Finally, a budget Microsoft tablet that works! For anyone wondering, this DOES run the full version of Windows. Just take it out of S Mode following the instructions here and you can install all of the Tetris apps to your heart's content! Really, though, it works like a normal PC once you do this... install any app you want.Read more", "ProductId": 24, "time": "October 25, 2018"}, {"rating": 1, "title": "poor choices app store", "content": "Bought at retail Microsoft store.  like keyboard and pen.  Dislike:  very limited choices for apps--no Wall Street Journal; cannot use full copy of Microsoft OneNote; my  journalling app of choice for microsoft products not an option.  No response trying to contact MicrosoftRead more", "ProductId": 24, "time": "September 24, 2018"}]}, {"information": {"basic": "New Microsoft Surface Go (Intel Pentium Gold) Pick Your Own: Type Cover, Pen, Mouse, Docking Station and More(8 GB 128 GB)", "price": "$659.99", "id": 25}, "review": [{"rating": 4, "title": "great for office or school", "content": "If I could give it 4.5 stars I would. It’s been a rockstar in my work life using the office suite, managing email, using web services and is capable of playing older PC games if I feel like it.My only big gripe is that battery life could be better, but this has mostly amounted to me changing my habits around device chargingRead more", "ProductId": 25, "time": "October 20, 2018"}, {"rating": 4, "title": "Impressed by this compact and relatively light 2 in 1, coming from a Galaxy book", "content": "My Samsung Galaxy book 10.6 stopped charging 1 month after the warranty expired and that left me without a compact 2 in 1 for travel and general media consumption. I purchased a Surface go, 8GB, 128GB SSD unit and was concerned about performance as the Galaxy book 10.6 I had was a core m3 vs the Surface Go's Pentium gold. However, in general web surfing and media consumption this device is plenty fast and doesn't feel bogged down in anyway. Also, it feels significantly lighter than my Galaxy book 10.6. The display quality is about the same as the Galaxy book. Overall, I'm impressed with this device.Read more", "ProductId": 25, "time": "November 1, 2018"}, {"rating": 1, "title": "Garbage, Microsoft had the right idea but just not powerful enough", "content": "I was dumping all my Apple products and gravitating towards Microsoft. What a mistake. First off, Microsoft was on the right track and I like the Windows OS and the use of a mouse etc. However, can this thing move any slower? It was brutal and the Pentium Chip is a joke. The thing took forever to set up and when it really came down to it, Microsoft Edge is the only browser you could use on this thing and the tablet and mouse and keyboard felt cheaply made. I returned the whole thing and I am back to the fast iPad!Read more", "ProductId": 25, "time": "November 19, 2018"}]}, {"information": {"basic": "New Microsoft Surface Go (Intel Pentium Gold, 4GB RAM, 128GB)", "price": "$499.00", "id": 26}, "review": [{"rating": 5, "title": "Strictly a secondary computer...love it!", "content": "Great portable computer. I have the Surface Pro 3 so I am familiar with the Surface family. I decided to see how long I can use the Surface Go with windows 10 S OS, which means that you can only install apps from the MS Windows Store...so far, so good. If I have a need to upgrade to Windows 10 Home, the switch is very easy via the Windows Store...just remember, you may have to update the Windows Store app then the upgrade to Windows 10 Home, for free, is available.I use this as a secondary computer to surf web, watch Netflix, work on MS Office documents...works exactly as advertised.Read more", "ProductId": 26, "time": "August 11, 2018"}, {"rating": 5, "title": "This is and outstanding device!", "content": "This is an outstanding device for what it was made for. Received it yesterday and found it to be more, much more, than I expected. The quality build is what you would expect from the surface line. The battery life could be better, but until the battery industry provides improved battery size, weight with performance, this is what we have to deal with for this size screen and quality with an intel chip. Most reviewers are bashing this thinking it should do what the surface pro does, how comical and disrespectful of their responsibility as professional tech authorities. My advice is to try it for yourself. Don't listen to the naysayers. This is an outstanding mobile device that has the ability to do on the go what you couldn't otherwise do with this size package. Are there improvements to be made, yes. But we didn't get the surface pro out the door before we had to deal with surface pro, 2,3, and 4...just saying :)Just a couple things on the other review.1. Upgrading to Windows Home from S mode was a breeze. Not sure what the other review was talking about, and it's free.2. Your going to have updates. This product was built and packaged way before they could update it with the latest firmware and other neccesarry improvements. Before you start using it, always go to update it to the latest software and firmware improvements. It didn't take long at all.Read more", "ProductId": 26, "time": "August 3, 2018"}, {"rating": 5, "title": "This thing is great", "content": "If you need a PC to do light work and can live with a 10 inch display, you'll love it. Or maybe you want a tablet that can be more than just that. I like the whole philosophy behind it, a device that you can take anywhere and use it in all your activities. After using it at work I can take the keyboard off and watch a movie or browse the web while listening some music or use a pen to do some digital painting as a hobby, It's just so versatile. I think this is the closest thing to what Microsoft wanted to achieve with the Surface line. Even closer than the already great Surface Pro.And there's this premium feel to it. The magnesium body feels very solid, the kickstand doesn't move if you don't want to and if you pair it with the Alcantara keyboard it's just a very different experience that you can feel. And yet it's so light. You'll have a disappointing experience touching a plastic laptop after using one of these.The downside is that it isn't precisely cheap. If you want it to be more than a tablet, you'll have to add the type cover keyboard, around $100 or more if you buy a Microsoft one (it's also great but I'm not reviewing it here). This just happens to be an affordable Surface product, and they're always expensive. But also so versatile and innovative that you'll find they worth it.It's also very sturdy. I found that out yesterday (there was a dog involved), it fell from a feet high right on the edge of the screen. I thought I would find a shattered or cracked display, but there was nothing on it. Not even on the edge, not a single dent or scratch on the whole thing, and it's working like if nothing happened (I'm using it to write this review).Most people complain about relatively short battery life but you can work for hours on it. I get it to work the whole day with the screen at its darkest and the battery saving mode on. Unless you use it outside that's enough brightness and performance for what you'll be using it. Another common complain are the thick bezels, but they're there for a reason, which becomes very obvious when you use it like a tablet.This might not be the device for you if what you want is high performance for CPU or graphic demanding tasks (and of course it's far from being a gamer PC) or if you really hate Windows. But if you're looking for a portable PC/tablet you can't go wrong with this. It's light, sturdy, completelly silent, has a sleek desing and offers a full desktop experience. And if you already own a Surface Pro you'll find this fascinating and even charming. It's a scaled down version of it.Read more", "ProductId": 26, "time": "September 16, 2018"}]}]}}